import styles from './terms.module.scss';

export const Terms = () => {
  return (
    <div className={styles.container}>
      <h2 className={styles.title}>Условия использования</h2>
      <h2 className={styles.categoryTitle}>Пользовательское Соглашение</h2>
      <p className={styles.marginLeft}>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем bookrental.ru (далее ЛитЭра или Администрация) с одной стороны и пользователем сайта с другой.</p>
      <p className={styles.marginLeft}>Сайт ЛитЭра не является средством массовой информации.</p>
      <p className={styles.marginLeft}>Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями данного соглашения, не используйте сайт ЛитЭра!</p>
      <h2 className={styles.categoryTitle}>Предмет соглашения</h2>
      <p className={styles.marginLeft}>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>
      <p className={styles.subparagraph}>- Текстовой информации</p>
      <p className={styles.subparagraph}>- Фотоматериалов</p>
      <p className={styles.subparagraph}>- Ссылок на материалы, размещенные на других сайтах</p>
      <h2 className={styles.categoryTitle}>Права и обязанности сторон</h2>
      <p className={styles.marginLeft}>Пользователь имеет право:</p>
      <p className={styles.subparagraph}>- осуществлять поиск информации на сайте</p>
      <p className={styles.subparagraph}>- получать информацию на сайте</p>
      <p className={styles.subparagraph}>- создавать информацию для сайта</p>
      <p className={styles.subparagraph}>- распространять информацию на сайте</p>
      <p className={styles.subparagraph}>- комментировать контент, выложенный на сайте</p>
      <p className={styles.subparagraph}>- изменять рейтинг пользователей</p>
      <p className={styles.subparagraph}>- копировать информацию на другие сайты с указанием источника</p>
      <p className={styles.subparagraph}>- требовать от администрации скрытия любой информации о пользователе</p>
      <p className={styles.subparagraph}>- требовать от администрации скрытия любой информации переданной пользователем сайту</p>
      <p className={styles.subparagraph}>- использовать информацию сайта в личных некоммерческих целях</p>
      <h2 className={styles.categoryTitle}>Администрация имеет право:</h2>
      <p className={styles.marginLeft}>- по своему усмотрению и необходимости создавать, изменять, отменять правила</p>
      <p className={styles.marginLeft}>- ограничивать доступ к любой информации на сайте</p>
      <p className={styles.marginLeft}>- создавать, изменять, удалять информацию</p>
      <p className={styles.marginLeft}>- удалять учетные записи</p>
      <p className={styles.marginLeft}>- отказывать в регистрации без объяснения причинПользователь обязуется:</p>
      <p className={styles.marginLeft}>- обеспечить достоверность предоставляемой информации</p>
      <p className={styles.marginLeft}>- обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</p>
      <p className={styles.marginLeft}>- не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</p>
      <p className={styles.marginLeft}>- не нарушать работоспособность сайта</p>
      <p className={styles.marginLeft}>- не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</p>
      <p className={styles.marginLeft}>- не совершать действия,направленные на введение других Пользователей в заблуждение</p>
      <p className={styles.marginLeft}>- не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</p>
      <p className={styles.marginLeft}>- не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</p>
      <p className={styles.marginLeft}>- не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</p>
      <p className={styles.marginLeft}>- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</p>
      <h2 className={styles.categoryTitle}>Администрация обязуется:</h2>
      <p className={styles.marginLeft}>- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</p>
      <p className={styles.marginLeft}>- осуществлять разностороннюю защиту учетной записи Пользователя</p>
      <p className={styles.marginLeft}>- защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</p>
      <p className={styles.marginLeft}>- предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</p>
      <h2 className={styles.categoryTitle}>Ответственность сторон</h2>
      <p className={styles.marginLeft}>- пользователь лично несет полную ответственность за распространяемую им информацию</p>
      <p className={styles.marginLeft}>- администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</p>
      <p className={styles.marginLeft}>- администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</p>
      <p className={styles.marginLeft}>- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</p>
      <p className={styles.marginLeft}>- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</p>
      <h2 className={styles.categoryTitle}>Условия действия Соглашения</h2>
      <p className={styles.marginLeft}>Данное Соглашение вступает в силу при регистрации на сайте.</p>
      <p className={styles.marginLeft}>Соглашение перестает действовать при появлении его новой версии.Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</p>
      <p className={styles.marginLeft}>При любом изменении данного соглашения, администрация будет оповещать пользователей удобным для нее способом.</p>
    </div>
  );
};
